app/views/inventories/index.html.erb

                  <div class="flex flex-col space-y-1">
                    <span class="text-sm font-medium"><%= inventory.delivery_time&.strftime("%d %b, %Y") %> (<%= inventory.beer_dispatch.order.order_number %>)</span>
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 24 LIMIT 1