app/views/inventories/received_stock_details.html.erb

SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 32 LIMIT 1
---
                  <div class="flex flex-col space-y-1">
                    <span class="text-sm font-medium"><%= inventory.beer_dispatch.order.order_date&.strftime("%d %b, %Y") %> (<%= inventory.beer_dispatch.order.order_number %>)</span>

SELECT `statuses`.* FROM `statuses` WHERE `statuses`.`id` = 4 LIMIT 1
---
                    <span class="text-xs">Warehouse: <span class="font-normal"><%= inventory.warehouse&.name %></span></span>
                    <% if inventory.beer_dispatch.order.status.code != "POS" %>