app/views/employees/index.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`employee_id` = 1 LIMIT 1
---
                <td class="p-4 text-sm font-normal text-gray-900 whitespace-nowrap dark:text-white">
                  <% if employee.user.present?%>

SELECT `employee_territories`.* FROM `employee_territories` WHERE `employee_territories`.`employee_id` = 1
---
                <td class="p-4 text-sm font-normal text-gray-900 whitespace-nowrap dark:text-white">
                  <% if employee.employee_territories.present? %>