app/views/beer_dispatches/index.html.erb

                <td class="p-4 text-sm font-normal text-gray-900 whitespace-nowrap dark:text-white">
                  <div class="flex flex-col space-y-1 <% if dispatch.order.status.code == 'ODR' %>text-green-600 dark:text-green-400<% elsif dispatch.order.status.name == "Order Delivered" %>text-blue-600 dark:text-blue-400<% else %>text-gray-600 dark:text-gray-400<% end %>">
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 32 LIMIT 1
SELECT `statuses`.* FROM `statuses` WHERE `statuses`.`id` = 3 LIMIT 1