app/views/users/_form.html.erb

      <label for="store_id" class="text-sm text-gray-600 dark:text-gray-400">Store</label>
      <%= form.select :store_id, Store.all.collect { |store| [store.store_name, store.id] }, { include_blank: "Select a store" }, {id: "store_id", class: "bg-gray-50 border border-gray-300 text-gray-900 text-sm rounded-lg focus:ring-primary-600 focus:border-primary-600 block w-full p-2.5 dark:bg-gray-600 dark:border-gray-500 dark:placeholder-gray-400 dark:text-white dark:focus:ring-primary-500 dark:focus:border-primary-500"} %>
---
SELECT `stores`.* FROM `stores`