app/views/users/index.html.erb

                <td class="p-4 text-sm font-normal text-gray-900 whitespace-nowrap dark:text-white">
                  <% if user.user_modules.present? %>
---
SELECT `user_modules`.* FROM `user_modules` WHERE `user_modules`.`user_id` = 1