app/views/statements/adjustments.html.erb

SELECT `vendor_adjustiment_items`.* FROM `vendor_adjustiment_items` WHERE `vendor_adjustiment_items`.`vendor_adjustiment_id` = 2
---
                <td class="p-4 text-sm font-normal text-gray-900 whitespace-nowrap dark:text-white">
                  <% vendor_adjustiment.vendor_adjustiment_items.each do |item|%>