app/views/statements/beer_purchases.html.erb

SELECT `inventory_items`.* FROM `inventory_items` WHERE `inventory_items`.`inventory_id` = 57
---
                  <div class="flex flex-col space-y-1">
                    <span class="text-sm font-medium"><%= order.delivery_time&.strftime("%d %b, %Y") %> (<%= number_to_currency(order.inventory_items.sum { |item| (item.nile_product.buying_price).to_i * (item.quantity_received).to_i }, unit: "UGX", precision: 0) %>)</span>