app/views/orders/canceled.html.erb

                    <tbody>
                      <% order.order_items.each_with_index do |item, index| %>
---
SELECT `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 33