app/views/orders/index.html.erb

SELECT `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 32
---
                    <tbody>
                      <% order.order_items.each_with_index do |item, index| %>