app/views/loading_orders/approvals.html.erb

                <td class="p-4 text-xs font-normal text-gray-900 whitespace-normal dark:text-white">
                  <%item.loading_order_items.each do |product|%>
---
SELECT `loading_order_items`.* FROM `loading_order_items` WHERE `loading_order_items`.`loading_order_id` = 17

                <td class="p-4 text-xs font-normal text-gray-900 whitespace-normal dark:text-white">
                  <span class="font-normal">Sales Agent: <%=Employee.find_by(id: item.sales_man).fullname%></span><br/>
                  <span class="font-normal">Driver: <%=item.driver_name%></span><br/>
                  <span class="font-normal">Authorizing Manager: <%=Employee.find_by(id: item.authorized_by).fullname%></span><br/>
---
SELECT `employees`.* FROM `employees` WHERE `employees`.`id` IS NULL LIMIT 1