app/views/payments/_form.html.erb

SELECT `suppliers`.* FROM `suppliers`
---
      <%= form.label :recipient_type,"Pay to.", class:"text-sm text-gray-600 dark:text-gray-400" %> <i class="text-sm text-red-600 dark:text-red-400">*</i>
      <%= form.select :recipient_type, [["Employee", "Employee"], ["Supplier", "Supplier"]], { include_blank: "---select---" }, {id: "recipient_type", data:{action:"change->payment#displayRecipientOptions"}, class: "bg-gray-50 border border-gray-300 text-gray-900 text-sm rounded-lg focus:ring-primary-600 focus:border-primary-600 block w-full p-2.5 dark:bg-gray-600 dark:border-gray-500 dark:placeholder-gray-400 dark:text-white dark:focus:ring-primary-500 dark:focus:border-primary-500"} %>