app/controllers/application_controller.rb

SELECT `territories`.* FROM `territories` WHERE `territories`.`id` = 1 LIMIT 1
---
  def current_territory
    @current_territory ||= begin
      if session[:current_territory_id].present?
        Territory.includes(Territory.reflect_on_all_associations.map(&:name))
                .find_by(id: session[:current_territory_id])