app/controllers/bank_deposits_controller.rb

  def index
    @bank_deposits = BankDeposit.search(params, current_territory.id).page(params[:page]).per(20)
---
SELECT `bank_deposits`.* FROM `bank_deposits` WHERE (territory_id='1') LIMIT 20 OFFSET 0

  def new
    @bank_deposit = BankDeposit.new
    @bank_accounts = BankAccount.all
---
SELECT `bank_accounts`.* FROM `bank_accounts`