app/controllers/bank_transfers_controller.rb

SELECT `territories`.* FROM `territories` WHERE `territories`.`id` = 1 LIMIT 1
SELECT `bank_transfers`.* FROM `bank_transfers` WHERE `bank_transfers`.`territory_id` = 1 ORDER BY `bank_transfers`.`transfer_date` DESC LIMIT 10 OFFSET 0
---
  def index
    @territory = Territory.find(current_territory.id)
    @bank_transfers = @territory.bank_transfers.order(transfer_date: :desc).page(params[:page]).per(10)

SELECT `territories`.* FROM `territories` WHERE `territories`.`id` = 1 LIMIT 1
SELECT `bank_accounts`.* FROM `bank_accounts` WHERE `bank_accounts`.`territory_id` = 1 ORDER BY `bank_accounts`.`account_number` ASC
---
  def new
    @bank_transfer = BankTransfer.new(transfer_date: DateTime.now)
    @current_territory = Territory.find(current_territory.id)
    @bank_accounts = @current_territory.bank_accounts.order(:account_number)