app/controllers/bank_withdraws_controller.rb

SELECT `bank_withdraws`.* FROM `bank_withdraws` WHERE (territory_id='1') LIMIT 20 OFFSET 0
---
  def index
    @active_link='withdraws'
    @bank_withdraws = BankWithdraw.search(params, current_territory.id).page(params[:page]).per(20)