app/controllers/beer_returns_controller.rb

SELECT `beer_returns`.* FROM `beer_returns` WHERE `beer_returns`.`territory_id` = 1 ORDER BY `beer_returns`.`created_at` DESC LIMIT 20 OFFSET 0
---
  def index
    @active_link = "purchases"
    @active_sub_link = "returns"
    params[:start_date] ||= Date.current.beginning_of_month
    params[:end_date]   ||= Date.current.end_of_month
    @beer_returns = BeerReturn.search(params, current_territory.id).order(created_at: :desc).page(params[:page]).per(20)

SELECT `stores`.* FROM `stores` WHERE `stores`.`territory_id` = 1 ORDER BY `stores`.`name` ASC
---
  def return_summary
    @active_link = "purchases"
    @active_sub_link = "returns"

    @stores = current_territory.stores.order(:name)

SELECT `stores`.* FROM `stores` WHERE `stores`.`territory_id` = 1 ORDER BY `stores`.`name` ASC
---
  def holding_sale_summary
    @active_link = "purchases"
    @active_sub_link = "holding_sale"

    @stores = current_territory.stores.order(:name)

SELECT `loading_orders`.* FROM `loading_orders` WHERE `loading_orders`.`id` = 17 LIMIT 1
SELECT `loading_order_items`.* FROM `loading_order_items` WHERE `loading_order_items`.`loading_order_id` = 17
---
  def new
    @active_link = "pending"
    @order = LoadingOrder.find(params[:id])

    @beer_return = BeerReturn.new

    @order.loading_order_items.each do |order_item|