app/controllers/beer_dispatches_controller.rb

SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 33 LIMIT 1
SELECT `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 33
---
  def new
    puts "CURRENT USER: #{current_user.id}"
    @order = Order.find(params[:id])
    @beer_dispatch = BeerDispatch.new
    # Build dispatch items based on existing order items
    @order.order_items.each do |order_item|

SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 33 LIMIT 1
SELECT `order_items`.* FROM `order_items` WHERE `order_items`.`id` = 49 LIMIT 1
INSERT INTO `beer_dispatches` (`fdn_number`, `truck_numberplate`, `trailer_plate`, `second_trailer`, `delivery_plant`, `shipping_point`, `loading_time`, `order_id`, `dispatch_no`, `user_id`, `created_at`, `updated_at`, `territory_id`, `driver_name`, `driver_mobile`, `invoice_no`, `status_id`) VALUES (NULL, 'UA 123 AQ', '', '', 'Mbarara', 'Kampala', '2026-06-12 10:51:00', 33, '00011', 1, '2026-06-12 07:52:08.275095', '2026-06-12 07:52:08.275095', 1, 'Henry', '0772341567', NULL, 4)
UPDATE `orders` SET `orders`.`status_id` = 3, `orders`.`updated_at` = '2026-06-12 07:52:08.292884' WHERE `orders`.`id` = 33
---
  def create
    order_id = beer_dispatch_params[:order_id]
    @order = Order.find(order_id)
    @beer_dispatch = BeerDispatch.new(beer_dispatch_params)
    @beer_dispatch.status_id = 4 # Set status to "Dispatched"
    @order_items = @order.order_items
    respond_to do |format|
      if @beer_dispatch.save
        @order.update(status_id: 3)

SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 37 LIMIT 1
UPDATE `orders` SET `orders`.`status_id` = 2, `orders`.`updated_at` = '2026-06-12 10:11:37.460246' WHERE `orders`.`id` = 37
DELETE FROM `beer_dispatches` WHERE `beer_dispatches`.`id` = 40
---
  def destroy
    @order = @beer_dispatch.order
    if @order.update(status_id: 2)
      @beer_dispatch.destroy!

SELECT `beer_dispatches`.* FROM `beer_dispatches` WHERE `beer_dispatches`.`id` = 40 LIMIT 1
---
    def set_beer_dispatch
      @beer_dispatch = BeerDispatch.find(params[:id])