app/controllers/customers_controller.rb

  def index
    @customers = Customer.search(params).page(params[:page]).per(10)
---
SELECT `customers`.* FROM `customers` LIMIT 10 OFFSET 0

  def create
    @customer = Customer.new(customer_params)
    @customer.territory = current_territory
    respond_to do |format|
      if @customer.save
---
INSERT INTO `customers` (`name`, `email`, `mobile`, `location`, `created_at`, `updated_at`, `territory_id`, `brn`, `tin`) VALUES ('David', '', '', '', '2026-06-11 08:44:20.608556', '2026-06-11 08:44:20.608556', 1, '34567892345', NULL)