app/controllers/dashboard_controller.rb

SELECT `employee_territories`.* FROM `employee_territories` INNER JOIN `territories` ON `territories`.`id` = `employee_territories`.`territory_id` WHERE `employee_territories`.`employee_id` = 1 AND `territories`.`department_id` = 5
---
  def beer
    employee_territories = current_user.employee.employee_territories.joins(:territory).where(territories: { department_id: params[:id] })