app/controllers/dashboard_controller.rb

SELECT `territories`.`id` FROM `territories` INNER JOIN `employee_territories` ON `territories`.`id` = `employee_territories`.`territory_id` WHERE `employee_territories`.`employee_id` = 1
SELECT nile_products.*, SUM(sale_items.quantity_sold) AS total_sales FROM `nile_products` INNER JOIN `sale_items` ON `sale_items`.`nile_product_id` = `nile_products`.`id` INNER JOIN `sales` ON `sales`.`id` = `sale_items`.`sale_id` WHERE `sales`.`sale_date` BETWEEN '2026-06-01' AND '2026-06-07' AND `sales`.`territory_id` IN (1, 2) GROUP BY `nile_products`.`id` ORDER BY total_sales DESC LIMIT 10
---
  def beer
    user_territories = current_user.employee.territories.pluck(:id)
    today      = Date.current
    start_date = today.beginning_of_week(:monday)  # This will be Monday
    end_date   = today.end_of_week(:monday)          # This will be Sunday
    if params["territory_id"].present? && params["start"].present? && params["end"].present?
      start_date = Date.strptime(params["start"], '%d/%m/%Y')
      end_date = Date.strptime(params["end"], '%d/%m/%Y')
      territory_id = params["territory_id"]
      @top_products = NileProduct
      .joins(loading_order_items: { sale_items: :sale })
      .where(sales: { sale_date: start_date..end_date, territory_id: territory_id})
      .select("nile_products.*, SUM(sale_items.quantity_sold) AS total_sales")
      .group("nile_products.id")
      .order("total_sales DESC")
      .limit(10)