app/controllers/departments_controller.rb

SELECT `departments`.* FROM `departments` LIMIT 10 OFFSET 0
---
  def index
    @departments = Department.search(params).page(params[:page]).per(10)

UPDATE `departments` SET `departments`.`name` = 'Cement', `departments`.`updated_at` = '2026-06-03 07:55:10.137131' WHERE `departments`.`id` = 5
---
  def update
    respond_to do |format|
      if @department.update(department_params)

DELETE FROM `departments` WHERE `departments`.`id` = 1
---
  def destroy
    @department.destroy!

SELECT `departments`.* FROM `departments` WHERE `departments`.`id` = 5 LIMIT 1
---
    def set_department
      @department = Department.find(params[:id])