app/controllers/destinations_controller.rb

SELECT `destinations`.* FROM `destinations` LIMIT 20 OFFSET 0
---
  def index
    @destinations = Destination.search(params).page(params[:page]).per(20)

SELECT `nile_products`.* FROM `nile_products`
---
  def new
    @nile_products = NileProduct.all

SELECT `nile_products`.* FROM `nile_products`
---
  def edit
    @nile_products = NileProduct.all

INSERT INTO `destinations` (`nile_product_id`, `selling_price`, `name`, `created_at`, `updated_at`) VALUES (8, 20000, 'Kasese', '2026-06-05 17:14:56.070272', '2026-06-05 17:14:56.070272')
---
  def create
    @nile_products = NileProduct.all
    @destination = Destination.new(destination_params)

    respond_to do |format|
      if @destination.save

UPDATE `destinations` SET `destinations`.`updated_at` = '2026-06-09 07:34:28.008389', `destinations`.`code` = 'KBL' WHERE `destinations`.`id` = 2
---
  def update
    @nile_products = NileProduct.all
    respond_to do |format|
      if @destination.update(destination_params)

DELETE FROM `destinations` WHERE `destinations`.`id` = 1
---
  def destroy
    @destination.destroy!

SELECT `destinations`.* FROM `destinations` WHERE `destinations`.`id` = 1 LIMIT 1
---
    def set_destination
      @destination = Destination.find(params[:id])