app/controllers/discounts_controller.rb

  def index
    @discounts = Discount.search(params).page(params[:page]).per(10)
---
SELECT `discounts`.* FROM `discounts` LIMIT 10 OFFSET 0

  def create
    @discount = Discount.new(discount_params)

    respond_to do |format|
      if @discount.save
---
INSERT INTO `discounts` (`name`, `discount_type`, `discount_value`, `active`, `created_at`, `updated_at`) VALUES ('Bulk Purchase', 'percentage', 10, TRUE, '2026-07-04 07:28:35.179453', '2026-07-04 07:28:35.179453')

    def set_discount
      @discount = Discount.find(params[:id])
---
SELECT `discounts`.* FROM `discounts` WHERE `discounts`.`id` = 1 LIMIT 1