app/controllers/employees_controller.rb

SELECT `employees`.* FROM `employees` LIMIT 20 OFFSET 0
---
  def index
    @employees = Employee.search(params).page(params[:page]).per(20)

SELECT `positions`.* FROM `positions`
---
  def new
    @employee = Employee.new
    @positions = Position.all

INSERT INTO `employees` (`firstname`, `middlename`, `lastname`, `email`, `mobile`, `dob`, `address`, `nssf`, `tin`, `created_at`, `updated_at`, `position_id`) VALUES ('Patience', '', 'Atuhairwe', 'atuhairepatience.finance@kabacombra.com', '0751919035', '2026-06-01', '', '', '', '2026-06-03 11:07:12.076410', '2026-06-03 11:07:12.076410', 2)
---
  def create
    @employee = Employee.new(employee_params)
    @positions = Position.all
    respond_to do |format|
      if @employee.save

SELECT `employees`.* FROM `employees` WHERE `employees`.`id` IN (1, 2, 3)
---
    def set_employee
      @employee = Employee.find(params[:id])