app/controllers/empty_types_controller.rb

SELECT `empty_types`.* FROM `empty_types` ORDER BY `empty_types`.`empty_number` ASC LIMIT 20 OFFSET 0
---
  def index
    @empty_types = EmptyType.search(params).order(empty_number: :asc).page(params[:page]).per(20)