app/controllers/inventory_items_controller.rb

SELECT `territories`.* FROM `territories` WHERE `territories`.`id` = 1 LIMIT 1
---
  def empties
    @territory= Territory.find(current_territory.id)

SELECT `territories`.* FROM `territories` WHERE `territories`.`id` = 1 LIMIT 1
---
  def index
    @territory = Territory.find(current_territory.id)

SELECT `warehouses`.* FROM `warehouses` WHERE `warehouses`.`territory_id` = 1
---
  def received_stock
    @active_link = "purchases"
    @active_sub_link = "received"
    @warehouses = current_territory.warehouses

    @inventory_items = InventoryItem
      .product_summary(params, current_territory.id, current_user)
      .page(params[:page])
      .per(20)

SELECT `warehouses`.* FROM `warehouses` WHERE `warehouses`.`territory_id` = 1
---
  def warehouses_overview
    @territory = current_territory

    today = Date.today.beginning_of_day
    tomorrow = today + 1.day

    @warehouses = @territory.warehouses

    @warehouse_stats = @warehouses.map do |store|