app/controllers/inventories_controller.rb

  def receive
    @inventory = Inventory.find(params[:id])
    @beer_dispatch = @inventory.beer_dispatch
    @order = @inventory.beer_dispatch.order
    if @beer_dispatch.update(status_id: 13) # Update beer dispatch status to "Received"
      @order.update(status_id: 13) # Update order status to "Completed"
      @inventory.update(status_id: 13) # Update inventory status to "Received"
---
UPDATE `inventories` SET `inventories`.`updated_at` = '2026-06-12 09:25:04.937210', `inventories`.`status_id` = 13 WHERE `inventories`.`id` = 60

  def show
    @dispatch = BeerDispatch.find(@inventory.beer_dispatch_id)
    @inventory = Inventory.new(delivery_time: Time.now)
    @warehouses = current_territory.warehouses
    # Build dispatch items based on existing order items
    @dispatch.dispatch_items.each do |item|
      @inventory.inventory_items.build(
        dispatch_item_id: item.id,
        quantity_dispatched: item.quantity_dispatched,
        quantity_received: item.quantity_dispatched,
        purchase_price: item.order_item.unit_price,
        selling_price: item.order_item.nile_product.selling_price
      )
---
SELECT `inventory_items`.* FROM `inventory_items` WHERE `inventory_items`.`inventory_id` = 61 AND `inventory_items`.`id` = 84 ORDER BY `inventory_items`.`id` ASC LIMIT 1

  def create
    dispatch_id = inventory_params[:beer_dispatch_id]
    @dispatch = BeerDispatch.find(dispatch_id)
---
SELECT `beer_dispatches`.* FROM `beer_dispatches` WHERE `beer_dispatches`.`id` = 40 LIMIT 1

  def update
    @dispatch = BeerDispatch.find(@inventory.beer_dispatch_id)
    @order = @dispatch.order

    @warehouses = current_territory.warehouses
    @dispatch_items = @dispatch.dispatch_items

    respond_to do |format|
      begin
        ActiveRecord::Base.transaction do
          @inventory.update!(
            inventory_params.merge(status_id: 13)
          )

          @dispatch.update!(status_id: 13)
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 36 LIMIT 1
UPDATE `beer_dispatches` SET `beer_dispatches`.`updated_at` = '2026-06-12 09:33:09.980489', `beer_dispatches`.`status_id` = 13 WHERE `beer_dispatches`.`id` = 39
UPDATE `inventories` SET `inventories`.`updated_at` = '2026-06-12 09:25:04.937210', `inventories`.`status_id` = 13 WHERE `inventories`.`id` = 60
UPDATE `orders` SET `orders`.`status_id` = 13, `orders`.`updated_at` = '2026-06-12 09:33:09.985013' WHERE `orders`.`id` = 36