app/controllers/inventories_controller.rb

  def index
    @inventories = Inventory.search(params, current_territory.id).page(params[:page]).per(20)
---
SELECT `inventories`.* FROM `inventories` WHERE `inventories`.`territory_id` = 1

  def received_stock_details
    @active_link = "purchases"
    @active_sub_link = "received"
    @inventories = Inventory.search_received(params, current_territory.id).page(params[:page]).per(20)
---
SELECT `inventories`.* FROM `inventories` WHERE `inventories`.`territory_id` = 1

  def receive
    @inventory = Inventory.find(params[:id])
    @beer_dispatch = @inventory.beer_dispatch
    @order = @inventory.beer_dispatch.order
    if @beer_dispatch.update(status_id: 13) # Update beer dispatch status to "Received"
      @order.update(status_id: 13) # Update order status to "Completed"
      @inventory.update(status_id: 13) # Update inventory status to "Received"
---
SELECT `inventories`.* FROM `inventories` WHERE `inventories`.`id` = 57 LIMIT 1
SELECT `inventories`.* FROM `inventories` WHERE `inventories`.`id` = 58 LIMIT 1
SELECT `beer_dispatches`.* FROM `beer_dispatches` WHERE `beer_dispatches`.`id` = 36 LIMIT 1
SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 32 LIMIT 1
UPDATE `inventories` SET `inventories`.`updated_at` = '2026-06-10 10:22:23.133123', `inventories`.`status_id` = 13 WHERE `inventories`.`id` = 57
UPDATE `beer_dispatches` SET `beer_dispatches`.`updated_at` = '2026-06-10 10:22:22.985505', `beer_dispatches`.`status_id` = 13 WHERE `beer_dispatches`.`id` = 35
UPDATE `beer_dispatches` SET `beer_dispatches`.`updated_at` = '2026-06-12 07:53:45.667727', `beer_dispatches`.`status_id` = 13 WHERE `beer_dispatches`.`id` = 36
UPDATE `orders` SET `orders`.`status_id` = 13, `orders`.`updated_at` = '2026-06-10 10:22:23.098517' WHERE `orders`.`id` = 32
UPDATE `orders` SET `orders`.`status_id` = 13, `orders`.`updated_at` = '2026-06-12 07:53:45.685242' WHERE `orders`.`id` = 33

  def show
    @dispatch = BeerDispatch.find(@inventory.beer_dispatch_id)
    @inventory = Inventory.new(delivery_time: Time.now)
    @warehouses = current_territory.warehouses
    # Build dispatch items based on existing order items
    @dispatch.dispatch_items.each do |item|
      @inventory.inventory_items.build(
        dispatch_item_id: item.id,
        quantity_dispatched: item.quantity_dispatched,
        quantity_received: item.quantity_dispatched,
        purchase_price: item.order_item.unit_price,
        selling_price: item.order_item.nile_product.selling_price
      )
---
SELECT `beer_dispatches`.* FROM `beer_dispatches` WHERE `beer_dispatches`.`id` = 35 LIMIT 1
SELECT `dispatch_items`.* FROM `dispatch_items` WHERE `dispatch_items`.`beer_dispatch_id` = 35
SELECT `inventories`.* FROM `inventories` WHERE `inventories`.`id` = 57 LIMIT 1
SELECT `nile_products`.* FROM `nile_products` WHERE `nile_products`.`id` = 8 LIMIT 1
SELECT `order_items`.* FROM `order_items` WHERE `order_items`.`id` = 49 LIMIT 1

  def new
    @dispatch = BeerDispatch.find(params[:id])
    @inventory = Inventory.new(delivery_time: Time.now)
    @warehouses = current_territory.warehouses
    # Build dispatch items based on existing order items
    @dispatch.dispatch_items.each do |item|
---
SELECT `beer_dispatches`.* FROM `beer_dispatches` WHERE `beer_dispatches`.`id` = 35 LIMIT 1
SELECT `dispatch_items`.* FROM `dispatch_items` WHERE `dispatch_items`.`beer_dispatch_id` = 35

  def edit
    @dispatch = BeerDispatch.find(@inventory.beer_dispatch_id)
    @inventory = Inventory.new(delivery_time: Time.now)
    @warehouses = current_territory.warehouses
    # Build dispatch items based on existing order items
    @dispatch.dispatch_items.each do |item|
      @inventory.inventory_items.build(
        dispatch_item_id: item.id,
        quantity_dispatched: item.quantity_dispatched,
        quantity_received: item.quantity_dispatched,
        purchase_price: item.order_item.unit_price,
        selling_price: item.order_item.nile_product.selling_price
      )
---
SELECT `beer_dispatches`.* FROM `beer_dispatches` WHERE `beer_dispatches`.`id` = 38 LIMIT 1
SELECT `dispatch_items`.* FROM `dispatch_items` WHERE `dispatch_items`.`beer_dispatch_id` = 38
SELECT `inventories`.* FROM `inventories` WHERE `inventories`.`id` = 60 LIMIT 1
SELECT `inventory_items`.* FROM `inventory_items` WHERE `inventory_items`.`inventory_id` = 60
SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 36 LIMIT 1
SELECT `beer_dispatches`.* FROM `beer_dispatches` WHERE `beer_dispatches`.`id` = 39 LIMIT 1

  def create
    dispatch_id = inventory_params[:beer_dispatch_id]
    @dispatch = BeerDispatch.find(dispatch_id)
    @warehouses = current_territory.warehouses
    @inventory = Inventory.new(inventory_params)
    @inventory.status_id = 4 # Set inventory status to "Received"
    @dispatch_items = @dispatch.dispatch_items
    respond_to do |format|
      if @inventory.save
        @dispatch.order.update(status_id: 4)
---
SELECT `beer_dispatches`.* FROM `beer_dispatches` WHERE `beer_dispatches`.`id` = 35 LIMIT 1
INSERT INTO `inventories` (`total`, `created_at`, `updated_at`, `user_id`, `delivery_time`, `territory_id`, `beer_dispatch_id`, `warehouse_id`, `status_id`) VALUES (NULL, '2026-06-09 08:10:17.227391', '2026-06-09 08:10:17.227391', 1, '2026-06-09 08:09:47', 1, 35, 1, 4)
UPDATE `beer_dispatches` SET `beer_dispatches`.`updated_at` = '2026-06-12 09:33:09.980489', `beer_dispatches`.`status_id` = 13 WHERE `beer_dispatches`.`id` = 39
SELECT `beer_dispatches`.* FROM `beer_dispatches` WHERE `beer_dispatches`.`id` = 39 LIMIT 1
SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 32 LIMIT 1
UPDATE `orders` SET `orders`.`status_id` = 4, `orders`.`updated_at` = '2026-06-09 08:10:17.392018' WHERE `orders`.`id` = 32

  def update
    dispatch_id = inventory_params[:beer_dispatch_id]
    @dispatch = BeerDispatch.find(dispatch_id)
---
SELECT `beer_dispatches`.* FROM `beer_dispatches` WHERE `beer_dispatches`.`id` = 38 LIMIT 1

  def destroy
    @beer_dispatch = @inventory.beer_dispatch
    @beer_dispatch&.order&.update(status_id: 3)

    @inventory.destroy!
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 37 LIMIT 1
UPDATE `orders` SET `orders`.`status_id` = 3, `orders`.`updated_at` = '2026-06-12 10:10:46.524802' WHERE `orders`.`id` = 37
DELETE FROM `inventories` WHERE `inventories`.`id` = 62

    def set_inventory
      @inventory = Inventory.find(params[:id])
---
SELECT `inventories`.* FROM `inventories` WHERE `inventories`.`id` = 57 LIMIT 1