app/controllers/loading_orders_controller.rb

  def loading_summary
    @active_link = "purchases"
    @active_sub_link = "loading_orders"

    @stores = current_territory.stores.order(:name)

    @start_date = params[:start_date].presence || Date.current
    @end_date   = params[:end_date].presence || Date.current

    # Products
    @products = NileProduct
      .order(:product_number)

    # Restrict products for non-super users
    unless current_user.is_super?
      @products = @products.where(
        store_id: current_user.store_id
      )

      # Also restrict the stores displayed in the report
      @stores = @stores.where(
        id: current_user.store_id
      )
---
SELECT `stores`.* FROM `stores` WHERE `stores`.`territory_id` = 1 ORDER BY `stores`.`name` ASC
SELECT `stores`.* FROM `stores` WHERE `stores`.`territory_id` = 1

  def new
    @active_link = "loading_orders"
    @active_sub_link = "loading_orders"

    @loading_order = LoadingOrder.new

    if current_user.is_super?
      @products = NileProduct.all
      @stores = Store.where(
        territory_id: current_territory.id
      )
---
SELECT `nile_products`.* FROM `nile_products`
SELECT `stores`.* FROM `stores` WHERE `stores`.`territory_id` = 1

  def create
    @active_link = "loading_orders"
    @loading_order = LoadingOrder.new(loading_order_params)
    @products = NileProduct.all
    @units = UnitOfMeasurement.all
    @employees = current_territory.employees
    @sale_types = SaleType.all
    @stores = Store.where(territory_id: current_territory.id)
    respond_to do |format|
      if @loading_order.save
        @loading_order.loading_order_items.each do |item|
---
SELECT `nile_products`.* FROM `nile_products`
SELECT `stores`.* FROM `stores` WHERE `stores`.`territory_id` = 1
INSERT INTO `loading_orders` (`user_id`, `territory_id`, `vehicle_numperplate`, `destination`, `loading_date`, `order_number`, `sales_man`, `authorized_by`, `verified_by`, `created_at`, `updated_at`, `status_id`, `driver_name`, `store_id`) VALUES (1, 1, 'UA 234 AT', NULL, '2026-06-10 00:00:00', 'MBA-0000002', NULL, 1, NULL, '2026-06-10 12:37:22.412661', '2026-06-10 12:37:22.412661', 6, 'Martin', 1)
SELECT `loading_order_items`.* FROM `loading_order_items` WHERE `loading_order_items`.`loading_order_id` = 17

  def destroy
    LoadingOrder.transaction do
      deallocate_inventory(@loading_order) # Call the deallocation logic
      @loading_order.destroy! # Destroy the loading order record
---
DELETE FROM `loading_orders` WHERE `loading_orders`.`id` = 17

    def set_loading_order
      @loading_order = LoadingOrder.find(params[:id])
---
SELECT `loading_orders`.* FROM `loading_orders` WHERE `loading_orders`.`id` = NULL LIMIT 1