app/controllers/nile_categories_controller.rb

  def index
    @nile_categories = NileCategory.search(params).page(params[:page]).per(20)
---
SELECT `nile_categories`.* FROM `nile_categories` LIMIT 20 OFFSET 0

  def create
    @nile_category = NileCategory.new(nile_category_params)

    respond_to do |format|
      if @nile_category.save
---
INSERT INTO `nile_categories` (`name`, `description`, `created_at`, `updated_at`) VALUES ('Tororo Cement', 'Tororo Cement', '2026-06-03 10:55:57.935500', '2026-06-03 10:55:57.935500')

  def update
    respond_to do |format|
      if @nile_category.update(nile_category_params)
---
UPDATE `nile_categories` SET `nile_categories`.`name` = 'Yaobai Cement', `nile_categories`.`description` = 'Yaobai Cement', `nile_categories`.`updated_at` = '2026-06-09 07:44:03.677674' WHERE `nile_categories`.`id` = 4

  def destroy
    @nile_category.destroy!
---
DELETE FROM `nile_categories` WHERE `nile_categories`.`id` = 1

    def set_nile_category
      @nile_category = NileCategory.find(params[:id])
---
SELECT `nile_categories`.* FROM `nile_categories` WHERE `nile_categories`.`id` = 3 LIMIT 1