app/controllers/nile_products_controller.rb

  def index
    @nile_products = NileProduct.search(params).order(product_number: :asc).page(params[:page]).per(20)
---
SELECT `nile_products`.* FROM `nile_products` ORDER BY `nile_products`.`product_number` ASC LIMIT 20 OFFSET 0

  def new
    @nile_product = NileProduct.new
    @nile_categories = NileCategory.all
    @empty_types = EmptyType.all
---
SELECT `nile_categories`.* FROM `nile_categories`
SELECT `empty_types`.* FROM `empty_types`

  def edit
    @nile_categories = NileCategory.all
---
SELECT `nile_categories`.* FROM `nile_categories`

  def create
    @nile_product = NileProduct.new(nile_product_params)
    @nile_categories = NileCategory.all
    @empty_types = EmptyType.all
    @stores = Store.order(:name)
    respond_to do |format|
      if @nile_product.save
---
INSERT INTO `nile_products` (`name`, `crate_size`, `bottle_size`, `pcode`, `nile_category_id`, `created_at`, `updated_at`, `buying_price`, `selling_price`, `empty_type_id`, `product_number`, `destination_id`) VALUES ('Bora 32.5R 50 KG Bag', NULL, NULL, 'P002', 4, '2026-06-09 07:45:45.897382', '2026-06-09 07:45:45.897382', '31000', '35000', NULL, 2, 2)

  def update
    @nile_categories = NileCategory.all
    @empty_types = EmptyType.all
    @stores = Store.order(:name)
    respond_to do |format|
      if @nile_product.update(nile_product_params)
---
UPDATE `nile_products` SET `nile_products`.`name` = 'Bora 32.5N 50 KG Bag', `nile_products`.`updated_at` = '2026-06-09 07:43:28.903669' WHERE `nile_products`.`id` = 8

  def destroy
    @nile_product.destroy!
---
DELETE FROM `nile_products` WHERE `nile_products`.`id` = 1

  def available_stock
    @product = NileProduct.find(params[:id])
---
SELECT `nile_products`.* FROM `nile_products` WHERE `nile_products`.`id` = 8 LIMIT 1

  def details
    product = NileProduct.find_by(id: params[:id])
---
SELECT `nile_products`.* FROM `nile_products` WHERE `nile_products`.`id` = 18 LIMIT 1

  def orderitemdetails
    product = NileProduct.find_by(id: params[:id])
---
SELECT `nile_products`.* FROM `nile_products` WHERE `nile_products`.`id` = 18 LIMIT 1

  def quantity_in
    @product = NileProduct.find(params[:id])
---
SELECT `nile_products`.* FROM `nile_products` WHERE `nile_products`.`id` = 1 LIMIT 1

    def set_nile_product
      @nile_product = NileProduct.find(params[:id])
---
SELECT `nile_products`.* FROM `nile_products` WHERE `nile_products`.`id` = 8 LIMIT 1