app/controllers/orders_controller.rb

INSERT INTO `orders` (`order_number`, `order_date`, `user_id`, `status_id`, `total_price`, `created_at`, `updated_at`, `departure_date`, `description`, `territory_id`) VALUES ('00009', '2026-06-10', 1, 2, NULL, '2026-06-10 11:16:29.419002', '2026-06-10 11:16:29.419002', '2026-06-10', '', 1)
---
  def create
    @order = Order.new(order_params)
    @routes = Route.all
    @products = NileProduct.all
    @units = UnitOfMeasurement.all
    respond_to do |format|
      if @order.save

SELECT `order_drivers`.* FROM `order_drivers` WHERE `order_drivers`.`order_id` = 37
---
  def assign_driver
    @order = Order.find(params[:id])
    @drivers = Driver.all
    @order_driver = @order.order_drivers.build

SELECT `drivers`.* FROM `drivers` INNER JOIN `order_drivers` ON `drivers`.`id` = `order_drivers`.`driver_id` WHERE `order_drivers`.`order_id` = 37
---
  def update_driver
    @order = Order.find(params[:id])
    @order_driver = @order.order_drivers.build(order_driver_params)

    if @order_driver.save
      @order.update(status_id: 2)
      @driver =Driver.find(@order_driver.driver.id)