app/controllers/orders_controller.rb

SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 33 LIMIT 1
UPDATE `orders` SET `orders`.`status_id` = 5, `orders`.`updated_at` = '2026-06-10 11:42:45.101542' WHERE `orders`.`id` = 33
---
  def cancel
    @order = Order.find(params[:id])

    if @order.update(
        status_id: 5
      )

SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 33 LIMIT 1
UPDATE `orders` SET `orders`.`status_id` = 2, `orders`.`updated_at` = '2026-06-10 11:53:01.295810' WHERE `orders`.`id` = 33
---
  def reverse
    @order = Order.find(params[:id])

    if @order.update(
        status_id: 2
      )

SELECT `nile_products`.* FROM `nile_products`
SELECT `unit_of_measurements`.* FROM `unit_of_measurements`
---
  def new
    @order = Order.new(order_date: Date.today, departure_date: Date.today)
    @order.order_items.build
    @products = NileProduct.all
    @units = UnitOfMeasurement.all

INSERT INTO `orders` (`order_number`, `order_date`, `user_id`, `status_id`, `total_price`, `created_at`, `updated_at`, `departure_date`, `description`, `territory_id`, `cancel_reason`) VALUES ('00010', '2026-06-12', 1, 2, NULL, '2026-06-12 08:25:53.449510', '2026-06-12 08:25:53.449510', '2026-06-12', '', 1, NULL)
---
  def create
    @order = Order.new(order_params)
    @routes = Route.all
    @products = NileProduct.all
    @units = UnitOfMeasurement.all
    respond_to do |format|
      if @order.save

DELETE FROM `orders` WHERE `orders`.`id` = 37
---
  def destroy
    @order.destroy!

SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 37 LIMIT 1
---
  def approve
    @order = Order.find(params[:id])

SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 37 LIMIT 1
---
    def set_order
      @order = Order.find(params[:id])