app/controllers/payments_controller.rb

SELECT `territories`.* FROM `territories` WHERE `territories`.`id` = 1 LIMIT 1
SELECT `payments`.* FROM `payments` WHERE `payments`.`territory_id` = 1 ORDER BY `payments`.`payment_date` DESC LIMIT 10 OFFSET 0
---
  def index
    @territory = Territory.find(current_territory.id)
    @payments = @territory.payments.page(params[:page]).per(10).order(payment_date: :desc)

SELECT `territories`.* FROM `territories` WHERE `territories`.`id` = 1 LIMIT 1
SELECT `suppliers`.* FROM `suppliers`
---
  def new
    @payment = Payment.new(payment_date: DateTime.now)
    @territory = Territory.find(current_territory.id)
    @employees = @territory.employees
    @suppliers = Supplier.all