app/controllers/sales_controller.rb

SELECT `stores`.* FROM `stores` WHERE `stores`.`territory_id` = 1 ORDER BY `stores`.`name` ASC
SELECT `stores`.* FROM `stores` WHERE `stores`.`territory_id` = 1
SELECT `nile_products`.* FROM `nile_products` ORDER BY `nile_products`.`product_number` ASC LIMIT 20 OFFSET 0
---
  def sales_summary
    @active_link = "sales"

    # Stores
    @stores = current_territory.stores.order(:name)

    # Products
    @products = NileProduct.order(:product_number)

    # Restrict non-super users to their store
    unless current_user.is_super?
      @stores = @stores.where(
        id: current_user.store_id
      )

      @products = @products.where(
        store_id: current_user.store_id
      )
    end

    # Search products
    if params[:query].present?
      @products = @products.where(
        "name LIKE ?",
        "%#{ActiveRecord::Base.sanitize_sql_like(params[:query])}%"
      )
    end

    # Pagination
    @products = @products
      .page(params[:page])
      .per(20)

SELECT `loading_order_items`.* FROM `loading_order_items` WHERE `loading_order_items`.`id` = 17 LIMIT 1
---
  def new
    @active_link = "pending"
    @discounts = Discount.active
    @order = LoadingOrder.find(params[:id])

    @sale = Sale.new(
      sale_date: DateTime.current,
      store_id: @order.store_id
    )

    @order.loading_order_items.each do |loading_item|

SELECT `sales`.* FROM `sales` ORDER BY `sales`.`created_at` DESC LIMIT 1
SELECT `sale_items`.* FROM `sale_items` WHERE `sale_items`.`sale_id` = 7
---
  def create
    create_customer_if_needed

    @sale = Sale.new(sale_params)

    # Set quantity_ordered from the loading order item.
    # Do this server-side instead of relying on the form.
    @sale.sale_items.each do |sale_item|