app/controllers/sales_controller.rb

SELECT `empty_types`.* FROM `empty_types`
---
  def new
    @active_link = "new"
    @sale = Sale.new(sale_date: DateTime.now)
    @products = LoadingOrderItem.joins(:loading_order).where(loading_orders:{sales_man: current_user.employee.id})
    @customers = current_territory.customers
    @employees = current_territory.employees
    @sale.sale_items.build
    #@sale.sale_empties.build
    @empties = EmptyType.all

INSERT INTO `sale_items` (`quantity_sold`, `amount`, `total`, `created_at`, `updated_at`, `empties_returned`, `cash_for_empties`, `sale_id`, `purchase_type_id`, `nile_product_id`, `loading_order_item_id`) VALUES (100, 30000, 3000000, '2026-06-18 11:42:50.223863', '2026-06-18 11:42:50.223863', NULL, NULL, 7, 1, 8, 17)
---
    def deduct_quantity(sale_item)
      loading_order_item = sale_item.loading_order_item

      if loading_order_item.remaining_quantity >= sale_item.quantity_sold
        loading_order_item.remaining_quantity -= sale_item.quantity_sold
        loading_order_item.save!