app/controllers/sales_controller.rb

SELECT `sales`.* FROM `sales` WHERE (DATE(sale_date) >= '2026-06-23') AND (DATE(sale_date) <= '2026-06-23') LIMIT 20 OFFSET 0
---
  def index
    @sales = Sale.search(params).page(params[:page]).per(20)

SELECT `loading_orders`.* FROM `loading_orders` WHERE `loading_orders`.`id` IS NULL LIMIT 1
SELECT `loading_order_items`.* FROM `loading_order_items` WHERE `loading_order_items`.`loading_order_id` = 17
SELECT `purchase_types`.* FROM `purchase_types`
---
  def new
    @active_link = "pending"

    @order = LoadingOrder.find_by(id: params[:id])
    @sale = Sale.new(sale_date: DateTime.now)
    # building items
    @order.loading_order_items.each do |loading_item|
      @sale.sale_items.build(
        loading_order_item_id: loading_item.id,
        nile_product_id: loading_item.nile_product_id,
        quantity_sold: loading_item.quantity_loaded,
        amount: loading_item.nile_product.buying_price,
        total: loading_item.quantity_loaded.to_i * loading_item.nile_product.selling_price.to_i
      )
    end

    @customers = current_territory.customers
    @employees = current_territory.employees
    @sale_items = @order.loading_order_items
    @purchase_types = PurchaseType.all

SELECT `purchase_types`.* FROM `purchase_types`
---
  def edit
    @products = LoadingOrderItem
      .joins(:loading_order, :nile_product)
      .where(loading_orders: { sales_man: current_user.employee.id })
      .group('nile_products.id', 'nile_products.name')
      .select('nile_product_id, nile_products.id, nile_products.name, SUM(loading_order_items.quantity_loaded) AS total_quantity')

    @customers = current_territory.customers
    @employees = current_territory.employees
    @empties = EmptyType.all
    @purchase_types = PurchaseType.all

SELECT `purchase_types`.* FROM `purchase_types`
INSERT INTO `sales` (`user_id`, `mode_of_payment`, `created_at`, `updated_at`, `receipt_no`, `territory_id`, `verified_by`, `sale_date`, `customer_name`, `tin`, `payment_ref`, `status_id`, `sales_route`, `customer_mobile`, `notes`, `vat`, `store_id`, `customer_id`) VALUES (1, 'cash', '2026-06-11 13:23:37.432538', '2026-06-11 13:23:37.432538', '00001', 1, NULL, '2026-06-11 13:23:20', 'David', '34567892345', '', 12, '', '', '', NULL, NULL, 1)
---
  def create
    create_customer_if_needed
    @sale = Sale.new(sale_params)
    @products = LoadingOrderItem.joins(:loading_order).where(loading_orders:{sales_man: current_user.employee.id})
    @customers = current_territory.customers
    @employees = current_territory.employees
    @empties = EmptyType.all
    @purchase_types = PurchaseType.all
    respond_to do |format|
      if @sale.save

DELETE FROM `sales` WHERE `sales`.`id` = 6
---
  def destroy
    @sale.destroy!

SELECT `sales`.* FROM `sales` WHERE `sales`.`id` = 6 LIMIT 1
---
  def sale_pdf
    @sale = Sale.find(params[:id])

INSERT INTO `customers` (`name`, `email`, `mobile`, `location`, `created_at`, `updated_at`, `territory_id`, `brn`, `tin`) VALUES ('', NULL, '', NULL, '2026-06-16 18:51:40.412875', '2026-06-16 18:51:40.412875', 1, '', NULL)
INSERT INTO `sales` (`user_id`, `mode_of_payment`, `created_at`, `updated_at`, `receipt_no`, `territory_id`, `verified_by`, `sale_date`, `customer_name`, `tin`, `payment_ref`, `status_id`, `sales_route`, `customer_mobile`, `notes`, `vat`, `customer_id`, `store_id`, `Fdn`, `InvoiceNo`) VALUES (1, 'cash', '2026-06-18 13:31:41.508337', '2026-06-18 13:31:41.508337', '00001', 1, NULL, '2026-06-18 13:31:22', 'David', '34567892345', '', 12, '', '', '', NULL, 1, NULL, NULL, NULL)
---
    def create_customer_if_needed
      return if params[:sale][:customer_id].present?

      customer = Customer.create!(
        name: params[:sale][:customer_name],
        mobile: params[:sale][:customer_mobile],
        brn: params[:sale][:tin],
        territory_id: current_territory.id
      )

SELECT `sales`.* FROM `sales` WHERE `sales`.`id` = 6 LIMIT 1
---
    def set_sale
      @sale = Sale.find(params[:id])

INSERT INTO `sale_items` (`quantity_sold`, `amount`, `total`, `created_at`, `updated_at`, `empties_returned`, `cash_for_empties`, `sale_id`, `purchase_type_id`, `nile_product_id`, `loading_order_item_id`) VALUES (5, 34000, 170000, '2026-06-23 18:21:42.612995', '2026-06-23 18:21:42.612995', NULL, NULL, 12, 1, 8, 20)
INSERT INTO `sales` (`user_id`, `mode_of_payment`, `created_at`, `updated_at`, `receipt_no`, `territory_id`, `verified_by`, `sale_date`, `customer_name`, `tin`, `payment_ref`, `status_id`, `sales_route`, `customer_mobile`, `notes`, `vat`, `customer_id`, `store_id`, `fdn`, `invoice_no`) VALUES (1, 'credit', '2026-06-23 18:21:42.570347', '2026-06-23 18:21:42.570347', NULL, 1, NULL, '2026-06-23 18:21:03', 'David', '34567892345', '', 12, 'Kabale', '', '', NULL, 1, 1, '456789123', 'INV/26/06/00001')
---
    def deduct_quantity(sale_item)
      loading_order_item = sale_item.loading_order_item

      if loading_order_item.remaining_quantity >= sale_item.quantity_sold
        loading_order_item.remaining_quantity -= sale_item.quantity_sold
        loading_order_item.save!