app/controllers/statements_controller.rb

  def beer_purchases
    @active_link='beer purchases'
    @territory = Territory.find(current_territory.id)
    @orders = @territory.inventories.page(params[:page]).per(10) # Order.search_vendor_purchases(params, current_territory.id).page(params[:page]).per(20)
---
SELECT `territories`.* FROM `territories` WHERE `territories`.`id` = 1 LIMIT 1
SELECT `inventories`.* FROM `inventories` WHERE `inventories`.`territory_id` = 1 LIMIT 10 OFFSET 0

  def payments
    @active_link='payments'
    @vendor_payments = current_territory.vendor_payments.page(params[:page]).per(20)
---
SELECT `payments`.* FROM `payments` WHERE `payments`.`territory_id` = 1
SELECT `vendor_payments`.* FROM `vendor_payments` WHERE `vendor_payments`.`territory_id` = 1

  def adjustments
    @active_link='adjustments'
    @territory = Territory.find(current_territory.id)
    @vendor_adjustiments = @territory.vendor_adjustiments.order(created_at: :desc).page(params[:page]).per(15)
---
SELECT `territories`.* FROM `territories` WHERE `territories`.`id` = 1 LIMIT 1
SELECT `vendor_adjustiments`.* FROM `vendor_adjustiments` WHERE `vendor_adjustiments`.`territory_id` = 1 ORDER BY `vendor_adjustiments`.`created_at` DESC LIMIT 15 OFFSET 0