app/controllers/statuses_controller.rb

SELECT `statuses`.* FROM `statuses` LIMIT 20 OFFSET 0
---
  def index
    @statuses = Status.search(params).page(params[:page]).per(20)

INSERT INTO `statuses` (`name`, `code`, `description`, `created_at`, `updated_at`) VALUES ('Purchase Order Rejected', 'POR', 'Purchase Order Rejected By Inventory', '2026-06-12 09:47:01.370145', '2026-06-12 09:47:01.370145')
---
  def create
    @status = Status.new(status_params)

    respond_to do |format|
      if @status.save