app/controllers/stock_transfers_controller.rb

SELECT `bank_transfers`.* FROM `bank_transfers` WHERE `bank_transfers`.`territory_id` = 1
---
  def transfer_summary
    @active_link = "purchases"
    @active_sub_link = "stock_transfers"

    territory_id = current_territory.id

    query = NileProduct
              .left_joins(stock_transfer_items: :stock_transfer)

    # Search
    if params[:query].present?
      query = query.where(
        "nile_products.name LIKE ?",
        "%#{ActiveRecord::Base.sanitize_sql_like(params[:query])}%"
      )
    end

    # Relevant transfers
    query = query.where(
      "
        stock_transfers.territory_id = :territory
        OR stock_transfers.source_id = :territory
        OR stock_transfers.destination_id = :territory
        OR stock_transfers.id IS NULL
      ",
      territory: territory_id
    )

SELECT `territories`.* FROM `territories`
SELECT `nile_products`.* FROM `nile_products`
---
  def new
    @active_link = "purchases"
    @active_sub_link = "stock_transfers"
    @stock_transfer = StockTransfer.new
    @warehouses = current_territory.warehouses
    @territories = Territory.all
    @products = NileProduct.all