app/controllers/stores_controller.rb

  def index
    @stores = Store.search(params).page(params[:page]).per(20)
---
SELECT `stores`.* FROM `stores` LIMIT 20 OFFSET 0