app/controllers/summaries_controller.rb

SELECT `bank_deposits`.* FROM `bank_deposits` WHERE `bank_deposits`.`territory_id` = 1
SELECT `bank_withdraws`.* FROM `bank_withdraws` WHERE `bank_withdraws`.`territory_id` = 1
SELECT `bank_transfers`.* FROM `bank_transfers` WHERE `bank_transfers`.`territory_id` = 1
---
    def load_dashboard_cards

      @bank_accounts =
        @territory.bank_accounts

      @bank_account_count =
        @bank_accounts.count

      @total_deposits =
        @territory.bank_deposits.sum(:amount)

      @total_withdrawals =
        @territory.bank_withdraws.sum(:amount)

      @total_transfers =
        @territory.bank_transfers.sum(:amount)