app/controllers/summaries_controller.rb

  def banking
    @active_link = "banking"
    @territory = Territory.find(current_territory.id)
    @recent_transactions = @territory.financial_transactions.order(created_at: :desc).limit(10)
    @accounts = @territory.bank_accounts
    @total_balance = @accounts.map(&:balance).sum
    @total_income = @territory.financial_transactions.where(transaction_type: "deposit").sum(:amount)
    @total_expenses = @territory.financial_transactions.where(transaction_type: "payment").sum(:amount)
---
SELECT `territories`.* FROM `territories` WHERE `territories`.`id` = 1 LIMIT 1
SELECT `financial_transactions`.* FROM `financial_transactions` WHERE `financial_transactions`.`territory_id` = 1 ORDER BY `financial_transactions`.`created_at` DESC LIMIT 10
SELECT `bank_accounts`.* FROM `bank_accounts` WHERE `bank_accounts`.`territory_id` = 1
SELECT SUM(`financial_transactions`.`amount`) FROM `financial_transactions` WHERE `financial_transactions`.`territory_id` = 1 AND `financial_transactions`.`transaction_type` = 'deposit'
SELECT SUM(`financial_transactions`.`amount`) FROM `financial_transactions` WHERE `financial_transactions`.`territory_id` = 1 AND `financial_transactions`.`transaction_type` = 'payment'