app/controllers/territories_controller.rb

  def index
    @territories = Territory.search(params).page(params[:page]).per(20)
---
SELECT `territories`.* FROM `territories` LIMIT 20 OFFSET 0

  def destroy
    @territory.destroy!
---
DELETE FROM `territories` WHERE `territories`.`id` = 2

    def set_territory
      @territory = Territory.find(params[:id])
---
SELECT `territories`.* FROM `territories` WHERE `territories`.`id` = 2 LIMIT 1