app/controllers/unit_of_measurements_controller.rb

SELECT `unit_of_measurements`.* FROM `unit_of_measurements` LIMIT 20 OFFSET 0
---
  def index
    @unit_of_measurements = UnitOfMeasurement.search(params).page(params[:page]).per(20)

UPDATE `unit_of_measurements` SET `unit_of_measurements`.`name` = 'Bags', `unit_of_measurements`.`code` = 'Bags', `unit_of_measurements`.`updated_at` = '2026-06-09 07:42:14.793390' WHERE `unit_of_measurements`.`id` = 1
---
  def update
    respond_to do |format|
      if @unit_of_measurement.update(unit_of_measurement_params)

DELETE FROM `unit_of_measurements` WHERE `unit_of_measurements`.`id` = 2
---
  def destroy
    @unit_of_measurement.destroy!

SELECT `unit_of_measurements`.* FROM `unit_of_measurements` WHERE `unit_of_measurements`.`id` = 2 LIMIT 1
---
    def set_unit_of_measurement
      @unit_of_measurement = UnitOfMeasurement.find(params[:id])