app/controllers/users_controller.rb

SELECT `users`.* FROM `users` LIMIT 20 OFFSET 0
---
  def index
    @users = User.search(params).page(params[:page]).per(20)

SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 4 LIMIT 1
---
  def new
    @user = User.new
    @employee  = Employee.find(params[:employee_id])

INSERT INTO `users` (`email`, `encrypted_password`, `reset_password_token`, `reset_password_sent_at`, `remember_created_at`, `created_at`, `updated_at`, `employee_id`, `role`, `is_super`, `store_id`) VALUES ('atuhairepatience.finance@kabacombra.com', '$2a$12$eSdU/Et9H2/0bLjBhQ2UEeZ0tsDSq8x7QY10NJ6aPmzeoyVS4Vn/a', NULL, NULL, NULL, '2026-06-03 11:07:31.580124', '2026-06-03 11:07:31.580124', 4, 2, TRUE, 1)
---
  def create
    puts "SAVING USER ...1"
    @user = User.new(user_params)
    puts "SAVING USER ..."
    respond_to do |format|
      @user.send_account_info_email
      if @user.save

UPDATE `users` SET `users`.`encrypted_password` = '$2a$12$y16aqryrH6ppwEW915fn2eZZA9m.V0Z9m7EhBfwPipGbALhosyPeu', `users`.`updated_at` = '2026-06-03 08:41:45.652075', `users`.`role` = 2 WHERE `users`.`id` = 2
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 2 LIMIT 1
---
  def update
    @employee = @user.employee

    if params[:user][:password].blank? &&
      params[:user][:password_confirmation].blank?

      params[:user].delete(:password)
      params[:user].delete(:password_confirmation)
    end

    Rails.logger.info "BEFORE UPDATE is_super: #{@user.is_super.inspect}"
    Rails.logger.info "PARAM is_super: #{user_params[:is_super].inspect}"

    if @user.update(user_params)

      Rails.logger.info "AFTER UPDATE is_super: #{@user.is_super.inspect}"
      Rails.logger.info "DB VALUE: #{User.find(@user.id).is_super.inspect}"

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
  def assign_store
    @user = User.find(params[:id])