app/controllers/welcome_controller.rb

  def beer

    emp_territory = EmployeeTerritory.find_by(territory_id: params[:id], employee_id: current_user.employee.id)
---
SELECT `employee_territories`.* FROM `employee_territories` WHERE `employee_territories`.`territory_id` = 1 AND `employee_territories`.`employee_id` = 1 LIMIT 1

  def set_current_territory(territory_id)
    selected_territory = Territory.find(territory_id)
---
SELECT `territories`.* FROM `territories` WHERE `territories`.`id` = 1 LIMIT 1