app/models/beer_dispatch.rb

SELECT `beer_dispatches`.* FROM `beer_dispatches` ORDER BY `beer_dispatches`.`created_at` DESC LIMIT 1
---
  def total_price
    dispatch_items.sum { |item| item.quantity_dispatched * item.order_item.unit_price }