app/models/inventory_item.rb

INSERT INTO `inventory_transactions` (`transaction_date`, `transaction_quantity`, `transaction_type`, `direction`, `note`, `created_at`, `updated_at`, `nile_product_id`, `territory_id`) VALUES ('2026-06-12 08:27:18', 300, 'purchase', 'in', 'inventory_item:81:purchase:in', '2026-06-12 09:02:58.619247', '2026-06-12 09:02:58.619247', 9, 1)
SELECT `inventory_items`.* FROM `inventory_items` ORDER BY `inventory_items`.`created_at` DESC LIMIT 1
INSERT INTO `inventory_transactions` (`transaction_date`, `transaction_quantity`, `transaction_type`, `direction`, `note`, `created_at`, `updated_at`, `nile_product_id`, `territory_id`) VALUES ('2026-06-12 07:52:21', 20, 'purchase', 'in', 'inventory_item:80:purchase:in', '2026-06-12 07:52:38.971973', '2026-06-12 07:52:38.971973', 8, 1)
---
      transaction_date: inventory.delivery_time
    ) if good_beer.present? && good_beer > 0

    inventory_transactions.create!(
      nile_product_id: nile_product_id,
      territory_id: inventory.territory_id,
      transaction_quantity: transfers,
      transaction_type: 'transfers',
      direction: 'out',
      transaction_date: inventory.delivery_time
    ) if transfers.present? && transfers > 0

    inventory_transactions.create!(
      nile_product_id: nile_product_id,
      territory_id: inventory.territory_id,
      transaction_quantity: returns,
      transaction_type: 'returns',
      direction: 'in',
      transaction_date: inventory.delivery_time
    ) if returns.present? && returns > 0

    inventory_transactions.create!(
      nile_product_id: nile_product_id,
      territory_id: inventory.territory_id,
      transaction_quantity: nbl_return,
      transaction_type: 'nbl_return',
      direction: 'out',
      transaction_date: inventory.delivery_time
    ) if nbl_return.present? && nbl_return > 0