app/models/inventory_transaction.rb

  def self.search_quantity_out(params, territory_id, product_id)
    query = joins(:territory, :nile_product)
      .where(
        territory_id: territory_id,
        nile_products: { id: product_id },
        direction: "out"
      )
---
SELECT SUM(CASE WHEN direction = 'in' THEN transaction_quantity ELSE -transaction_quantity END) FROM `inventory_transactions` WHERE `inventory_transactions`.`nile_product_id` = 8 AND `inventory_transactions`.`territory_id` = 1 AND (DATE(transaction_date) < '2026-06-10')