app/models/loading_order.rb

SELECT `employees`.* FROM `employees` WHERE `employees`.`id` IS NULL LIMIT 1
---
  def sales_person
    Employee.find_by(id: sales_man)&.fullname

INSERT INTO `inventory_transactions` (`transaction_date`, `transaction_quantity`, `transaction_type`, `direction`, `note`, `created_at`, `updated_at`, `nile_product_id`, `territory_id`) VALUES ('2026-06-10 00:00:00', 200, 'distribution', 'out', NULL, '2026-06-10 12:37:22.506495', '2026-06-10 12:37:22.506495', 8, 1)
---
  def create_inventory_transactions
    loading_order_items.each do |item|
      quantity = item.quantity_loaded
      next unless quantity.present? && quantity > 0

      InventoryTransaction.create!(
        nile_product_id: item.nile_product_id,
        territory_id: self.territory_id,
        transaction_quantity: quantity,
        transaction_type: 'distribution',
        direction: 'out',
        transaction_date: self.loading_date
      )

SELECT `loading_orders`.* FROM `loading_orders` WHERE `loading_orders`.`territory_id` = 1 AND (order_number LIKE 'MBA-%') ORDER BY `loading_orders`.`order_number` DESC LIMIT 1
---
  def generate_order_number
    return if order_number.present? || territory.blank?

    prefix = territory.name[0, 3].upcase
    last_order = LoadingOrder.where(territory_id: territory.id)
                             .order(order_number: :desc)
                             .where("order_number LIKE ?", "#{prefix}-%")
                             .first