app/models/loading_order_item.rb

INSERT INTO `store_transactions` (`nile_product_id`, `territory_id`, `user_id`, `quantity`, `direction`, `movement_type`, `notes`, `created_at`, `updated_at`, `store_id`, `transaction_date`) VALUES (8, 1, 1, 200, 'in', 'loading order', 'from loading order', '2026-06-10 12:37:22.457268', '2026-06-10 12:37:22.457268', 1, '2026-06-10 00:00:00')
---
  def create_transaction
    StoreTransaction.create!(
      nile_product_id: nile_product_id,
      territory_id: loading_order.territory_id,
      user_id: loading_order.user_id,
      store_id: loading_order.store_id,
      quantity: quantity_loaded,
      direction: "in",
      movement_type: "loading order",
      notes: "from loading order",
      transaction_date: loading_order.loading_date
    )