app/models/loading_order.rb

  def self.my_approvals(params, territory_id, user_id, status_id)
    query = where("status_id IN (?) AND territory_id = ? AND authorized_by = ?", [6], territory_id, user_id)

    if params[:query].present?
      query = query.where("order_number LIKE ?", "%#{sanitize_sql_like(params[:query])}%")
---
SELECT `loading_orders`.* FROM `loading_orders` WHERE `loading_orders`.`territory_id` = 1 AND (order_number LIKE 'MBA-%') ORDER BY `loading_orders`.`order_number` DESC LIMIT 1