app/models/order.rb

SELECT `orders`.* FROM `orders` ORDER BY `orders`.`created_at` DESC LIMIT 1
---
  def self.search_approved(params, territory_id, user)
    query = where(
      status_id: [15],
      territory_id: territory_id
    )

    # Restrict non-super users to their store
    unless user.is_super?
      query = query
              .joins(order_items: :nile_product)
              .where(nile_products: { store_id: user.store_ids })
              .distinct
    end

    # Search by order number
    if params[:query].present?

SELECT `orders`.* FROM `orders` ORDER BY `orders`.`created_at` DESC LIMIT 1
---
    end

    # End date filter
    if params[:end_date].present?