app/models/sale_item.rb

INSERT INTO `store_transactions` (`nile_product_id`, `territory_id`, `user_id`, `quantity`, `direction`, `movement_type`, `notes`, `created_at`, `updated_at`, `store_id`, `transaction_date`) VALUES (8, 1, 1, 200, 'out', 'sale', 'Normal', '2026-06-11 13:33:22.114958', '2026-06-11 13:33:22.114958', 1, '2026-06-11 13:33:05')
---
  def create_stock_adjustment
    available_stock = StoreTransaction.available_stock_for(nile_product_id)
    if available_stock >= quantity_sold
      StoreTransaction.create!(
        nile_product_id: nile_product_id,
        territory_id: sale.territory_id,
        user_id: sale.user_id,
        store_id: sale.store_id,
        quantity: quantity_sold,
        direction: "out",
        movement_type: "sale",
        notes: "#{purchase_type.name}",
        transaction_date: sale.sale_date
      )