app/models/sale.rb

  def total_price
    sale_items.sum(&:total)
---
SELECT `sales`.* FROM `sales` ORDER BY `sales`.`created_at` DESC LIMIT 1

  def update_loading_order_status
    loading_order_ids = sale_items
      .joins(:loading_order_item)
      .pluck("loading_order_items.loading_order_id")
      .uniq

    LoadingOrder.where(id: loading_order_ids).find_each do |loading_order|

      all_sold = loading_order.loading_order_items.all? do |item|
        item.sale_items.sum(:quantity_sold) >= item.quantity_loaded
      end

      loading_order.update_column(
        :status_id,
        all_sold ? 7 : 6
      )
---
SELECT `loading_order_items`.`loading_order_id` FROM `sale_items` INNER JOIN `loading_order_items` ON `loading_order_items`.`id` = `sale_items`.`loading_order_item_id` WHERE `sale_items`.`sale_id` = 12
SELECT `loading_orders`.* FROM `loading_orders` WHERE `loading_orders`.`id` = 18 ORDER BY `loading_orders`.`id` ASC LIMIT 1000
SELECT `loading_order_items`.* FROM `loading_order_items` WHERE `loading_order_items`.`loading_order_id` = 18
SELECT SUM(`sale_items`.`quantity_sold`) FROM `sale_items` WHERE `sale_items`.`loading_order_item_id` = 20
UPDATE `loading_orders` SET `loading_orders`.`status_id` = 6 WHERE `loading_orders`.`id` = 18
UPDATE `loading_order_items` SET `loading_order_items`.`remaining_quantity` = 15 WHERE `loading_order_items`.`id` = 20

  def update_remaining_quantities
    sale_items.each do |sale_item|
      loading_item = sale_item.loading_order_item

      sold_quantity = loading_item.sale_items.sum(:quantity_sold)
---
SELECT SUM(`sale_items`.`quantity_sold`) FROM `sale_items` WHERE `sale_items`.`loading_order_item_id` = 20 AND `sale_items`.`id` IS NOT NULL

  def create_customer_if_missing
    return if customer_name.blank?

    customer = Customer.find_by(
      name: customer_name,
      territory_id: territory_id
    )

    return self.customer_id = customer.id if customer.present?
---
SELECT `sales`.* FROM `sales` ORDER BY `sales`.`created_at` DESC LIMIT 1
SELECT `customers`.* FROM `customers` WHERE `customers`.`name` = 'David' AND `customers`.`territory_id` = 1 LIMIT 1

  def sufficient_stock
    sale_items.each do |sale_item|
      next if sale_item.loading_order_item.blank?

      loading_item = sale_item.loading_order_item

      sold_quantity = SaleItem
        .where(loading_order_item_id: loading_item.id)
        .where.not(id: sale_item.id)
        .sum(:quantity_sold)
---
SELECT `sales`.* FROM `sales` ORDER BY `sales`.`created_at` DESC LIMIT 1
SELECT SUM(`sale_items`.`quantity_sold`) FROM `sale_items` WHERE `sale_items`.`loading_order_item_id` = 20 AND `sale_items`.`id` IS NOT NULL

  def generate_invoice_number
    return if invoice_no.present?
---
SELECT `sales`.* FROM `sales` WHERE (invoice_no LIKE 'INV/26/06/%') ORDER BY `sales`.`created_at` DESC LIMIT 1

  def update_loading_order_status_after_destroy
    return unless @loading_order_ids.present?

    LoadingOrder.where(id: @loading_order_ids).each do |loading_order|
      all_sold = loading_order.loading_order_items.all? do |item|
        item.sale_items.sum(:quantity_sold) >= item.quantity_loaded
      end

      loading_order.update_column(
        :status_id,
        all_sold ? 7 : 6
      )
---
SELECT `loading_orders`.* FROM `loading_orders` WHERE `loading_orders`.`id` = 18
SELECT `loading_order_items`.* FROM `loading_order_items` WHERE `loading_order_items`.`loading_order_id` = 18
UPDATE `loading_order_items` SET `loading_order_items`.`remaining_quantity` = 15 WHERE `loading_order_items`.`id` = 20

  def recalculate_loading_order_quantities
    loading_order_ids = sale_items
      .joins(:loading_order_item)
      .pluck("loading_order_items.loading_order_id")
      .uniq

    LoadingOrder.where(id: loading_order_ids).each do |loading_order|
      loading_order.loading_order_items.each do |item|
        sold_quantity = item.sale_items.sum(:quantity_sold)
---
SELECT `loading_order_items`.`loading_order_id` FROM `sale_items` INNER JOIN `loading_order_items` ON `loading_order_items`.`id` = `sale_items`.`loading_order_item_id` WHERE `sale_items`.`sale_id` = 12
SELECT SUM(`sale_items`.`quantity_sold`) FROM `sale_items` WHERE `sale_items`.`loading_order_item_id` = 20