app/models/store_transaction.rb

SELECT SUM(`store_transactions`.`quantity`) FROM `store_transactions` WHERE `store_transactions`.`nile_product_id` IS NULL AND `store_transactions`.`direction` = 'in'
SELECT SUM(`store_transactions`.`quantity`) FROM `store_transactions` WHERE `store_transactions`.`nile_product_id` IS NULL AND `store_transactions`.`direction` = 'out'
---
  def self.available_stock_for(nile_product_id)
    stock_transactions = StoreTransaction.where(nile_product_id: nile_product_id)
    total_in  = stock_transactions.where(direction: 'in').sum(:quantity)
    total_out = stock_transactions.where(direction: 'out').sum(:quantity)