app/views/sales/index.html.erb

                <td class="p-4 text-sm font-normal text-gray-900 whitespace-normal dark:text-white">
                  <% sale.sale_items.each do |item|%>
---
SELECT `sale_items`.* FROM `sale_items` WHERE `sale_items`.`sale_id` = 3