app/views/layouts/application.html.erb

SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 1 LIMIT 1
---
                <p class="text-sm text-gray-900 dark:text-white" role="none">
                  Hi <%= current_user.employee.firstname %>