app/views/layouts/dashboard.html.erb

SELECT `departments`.* FROM `departments`
---
              <% if current_user.is_super? %>
                <% @depts = Department.all %>

SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 1 LIMIT 1
---
                <p class="text-sm text-gray-900 dark:text-white" role="none">
                  Hi <%= current_user.employee.firstname %>