app/views/layouts/home.html.erb

            <div class="px-4 py-2">
              <span class="block text-sm text-gray-900 dark:text-white">Hi <%=current_user.employee.firstname%></span>
---
SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 1 LIMIT 1